[Killed] ArrowFunction
src/components/App/index.js:8:13
 import GithubCorner from '../github/Corner';
 import FloatCart from '../FloatCart';
 
-const App = () => (
-  <React.Fragment>
-    <GithubCorner />
-    <main>
-      <Filter />
-      <Shelf />
-    </main>
-    <FloatCart />
-  </React.Fragment>
-);
+const App = () => undefined;
 
 export default App;
