[Survived] ObjectLiteral
src/components/Checkbox/index.js:5:22
 import PropTypes from 'prop-types';
 
 class Checkbox extends Component {
-  static propTypes = {
-    label: PropTypes.string.isRequired,
-    handleCheckboxChange: PropTypes.func.isRequired
-  };
+  static propTypes = {};
 
   state = {

[Killed] BooleanLiteral
src/components/Checkbox/index.js:11:16
   };
 
   state = {
-    isChecked: false
+    isChecked: true
   };
 

[Killed] BlockStatement
src/components/Checkbox/index.js:14:32
     isChecked: false
   };
 
-  toggleCheckboxChange = () => {
-    const { handleCheckboxChange, label } = this.props;
-
-    this.setState(({ isChecked }) => ({
-      isChecked: !isChecked
-    }));
-
-    handleCheckboxChange(label);
-  };
+  toggleCheckboxChange = () => {};
 
   render() {

[Killed] ArrowFunction
src/components/Checkbox/index.js:17:19
   toggleCheckboxChange = () => {
     const { handleCheckboxChange, label } = this.props;
 
-    this.setState(({ isChecked }) => ({
-      isChecked: !isChecked
-    }));
+    this.setState(() => undefined);
 
     handleCheckboxChange(label);

[Killed] BooleanLiteral
src/components/Checkbox/index.js:18:18
     const { handleCheckboxChange, label } = this.props;
 
     this.setState(({ isChecked }) => ({
-      isChecked: !isChecked
+      isChecked: isChecked
     }));
 

[Killed] BlockStatement
src/components/Checkbox/index.js:24:12
     handleCheckboxChange(label);
   };
 
-  render() {
-    const { label, classes } = this.props;
-    const { isChecked } = this.state;
-
-    return (
-      <div className={classes}>
-        <label>
-          <input
-            type="checkbox"
-            value={label}
-            checked={isChecked}
-            onChange={this.toggleCheckboxChange}
-          />
-
-          <span className="checkmark">{label}</span>
-        </label>
-      </div>
-    );
-  }
+  render() {}
 }
 
