[Killed] ArrowFunction
Shoppingtest/react-shopping-cart/src/Root.js:6:14
 
 import store from './services/store';
 
-const Root = ({ children, initialState = {} }) => (
-  <Provider store={store(initialState)}>{children}</Provider>
-);
+const Root = () => undefined;
 
 export default Root;
