[Killed] BlockStatement
components/FloatCart/CartProduct/index.js:14:22
     changeProductQuantity: PropTypes.func.isRequired,
   };
 
-  constructor(props) {
-    super(props);
-    this.state = {
-      product: this.props.product,
-      isMouseOver: false
-    };
-  }
+  constructor(props) {}
 
   handleMouseOver = () => {

[Killed] BooleanLiteral
components/FloatCart/CartProduct/index.js:18:20
     super(props);
     this.state = {
       product: this.props.product,
-      isMouseOver: false
+      isMouseOver: true
     };
   }

[Killed] BlockStatement
components/FloatCart/CartProduct/index.js:22:27
     };
   }
 
-  handleMouseOver = () => {
-    this.setState({ isMouseOver: true });
-  };
+  handleMouseOver = () => {};
 
   handleMouseOut = () => {

[Killed] BooleanLiteral
components/FloatCart/CartProduct/index.js:23:34
   }
 
   handleMouseOver = () => {
-    this.setState({ isMouseOver: true });
+    this.setState({ isMouseOver: false });
   };
 

[Survived] BlockStatement
components/FloatCart/CartProduct/index.js:26:26
     this.setState({ isMouseOver: true });
   };
 
-  handleMouseOut = () => {
-    this.setState({ isMouseOver: false });
-  };
+  handleMouseOut = () => {};
 
   handleOnIncrease = () => {

[Survived] BooleanLiteral
components/FloatCart/CartProduct/index.js:27:34
   };
 
   handleMouseOut = () => {
-    this.setState({ isMouseOver: false });
+    this.setState({ isMouseOver: true });
   };
 

[Survived] BlockStatement
components/FloatCart/CartProduct/index.js:30:28
     this.setState({ isMouseOver: false });
   };
 
-  handleOnIncrease = () => {
-    const { changeProductQuantity } = this.props;
-    const { product } = this.state;
-    product.quantity = product.quantity + 1;
-    changeProductQuantity(product);
-  }
+  handleOnIncrease = () => {}
 
   handleOnDecrease = () => {

[Survived] ArithmeticOperator
components/FloatCart/CartProduct/index.js:33:24
   handleOnIncrease = () => {
     const { changeProductQuantity } = this.props;
     const { product } = this.state;
-    product.quantity = product.quantity + 1;
+    product.quantity = product.quantity - 1;
     changeProductQuantity(product);
   }

[Survived] BlockStatement
components/FloatCart/CartProduct/index.js:37:28
     changeProductQuantity(product);
   }
 
-  handleOnDecrease = () => {
-    const { changeProductQuantity } = this.props;
-    const { product } = this.state;
-    product.quantity = product.quantity - 1;
-    changeProductQuantity(product);
-  }
+  handleOnDecrease = () => {}
 
   render() {

[Survived] ArithmeticOperator
components/FloatCart/CartProduct/index.js:40:24
   handleOnDecrease = () => {
     const { changeProductQuantity } = this.props;
     const { product } = this.state;
-    product.quantity = product.quantity - 1;
+    product.quantity = product.quantity + 1;
     changeProductQuantity(product);
   }

[Killed] StringLiteral
components/FloatCart/CartProduct/index.js:48:22
     const { removeProduct } = this.props;
     const { product } = this.state;
 
-    const classes = ['shelf-item'];
+    const classes = [""];
 
     if (!!this.state.isMouseOver) {

[Killed] ConditionalExpression
components/FloatCart/CartProduct/index.js:50:9
 
     const classes = ['shelf-item'];
 
-    if (!!this.state.isMouseOver) {
+    if (false) {
       classes.push('shelf-item--mouseover');
     }

[Killed] ConditionalExpression
components/FloatCart/CartProduct/index.js:50:9
 
     const classes = ['shelf-item'];
 
-    if (!!this.state.isMouseOver) {
+    if (true) {
       classes.push('shelf-item--mouseover');
     }

[Killed] ArrowFunction
components/FloatCart/CartProduct/index.js:58:24
       <div className={classes.join(' ')}>
         <div
           className="shelf-item__del"
-          onMouseOver={() => this.handleMouseOver()}
+          onMouseOver={() => undefined}
           onMouseOut={() => this.handleMouseOut()}
           onClick={() => removeProduct(product)}

[Survived] ArrowFunction
components/FloatCart/CartProduct/index.js:59:23
         <div
           className="shelf-item__del"
           onMouseOver={() => this.handleMouseOver()}
-          onMouseOut={() => this.handleMouseOut()}
+          onMouseOut={() => undefined}
           onClick={() => removeProduct(product)}
         />

[Survived] ArrowFunction
components/FloatCart/CartProduct/index.js:60:20
           className="shelf-item__del"
           onMouseOver={() => this.handleMouseOver()}
           onMouseOut={() => this.handleMouseOut()}
-          onClick={() => removeProduct(product)}
+          onClick={() => undefined}
         />
         <Thumb

[Survived] ConditionalExpression
components/FloatCart/CartProduct/index.js:77:63
         <div className="shelf-item__price">
           <p>{`${product.currencyFormat}  ${formatPrice(product.price)}`}</p>
           <div>
-            <button onClick={this.handleOnDecrease} disabled={product.quantity === 1 ? true : false} className="change-product-button">-</button>
+            <button onClick={this.handleOnDecrease} disabled={false ? true : false} className="change-product-button">-</button>
             <button onClick={this.handleOnIncrease} className="change-product-button">+</button>
           </div>

[Survived] ConditionalExpression
components/FloatCart/CartProduct/index.js:77:63
         <div className="shelf-item__price">
           <p>{`${product.currencyFormat}  ${formatPrice(product.price)}`}</p>
           <div>
-            <button onClick={this.handleOnDecrease} disabled={product.quantity === 1 ? true : false} className="change-product-button">-</button>
+            <button onClick={this.handleOnDecrease} disabled={true ? true : false} className="change-product-button">-</button>
             <button onClick={this.handleOnIncrease} className="change-product-button">+</button>
           </div>
