[Survived] ObjectLiteral
src/components/FloatCart/index.js:24:11
     productToChange: PropTypes.object,
   };
 
-  state = {
-    isOpen: false
-  };
+  state = {};
 
   componentWillReceiveProps(nextProps) {

[Survived] BooleanLiteral
src/components/FloatCart/index.js:25:13
   };
 
   state = {
-    isOpen: false
+    isOpen: true
   };
 

[Killed] BlockStatement
src/components/FloatCart/index.js:28:40
     isOpen: false
   };
 
-  componentWillReceiveProps(nextProps) {
-    if (nextProps.newProduct !== this.props.newProduct) {
-      this.addProduct(nextProps.newProduct);
-    }
-
-    if (nextProps.productToRemove !== this.props.productToRemove) {
-      this.removeProduct(nextProps.productToRemove);
-    }
-
-    if (nextProps.productToChange !== this.props.productToChange) {
-      this.changeProductQuantity(nextProps.productToChange);
-    }
-  }
+  componentWillReceiveProps(nextProps) {}
 
   openFloatCart = () => {

[Killed] BlockStatement
src/components/FloatCart/index.js:29:57
   };
 
   componentWillReceiveProps(nextProps) {
-    if (nextProps.newProduct !== this.props.newProduct) {
-      this.addProduct(nextProps.newProduct);
-    }
+    if (nextProps.newProduct !== this.props.newProduct) {}
 
     if (nextProps.productToRemove !== this.props.productToRemove) {

[Killed] ConditionalExpression
src/components/FloatCart/index.js:29:9
   };
 
   componentWillReceiveProps(nextProps) {
-    if (nextProps.newProduct !== this.props.newProduct) {
+    if (true) {
       this.addProduct(nextProps.newProduct);
     }

[Killed] ConditionalExpression
src/components/FloatCart/index.js:33:9
       this.addProduct(nextProps.newProduct);
     }
 
-    if (nextProps.productToRemove !== this.props.productToRemove) {
+    if (true) {
       this.removeProduct(nextProps.productToRemove);
     }

[Killed] EqualityOperator
src/components/FloatCart/index.js:33:9
       this.addProduct(nextProps.newProduct);
     }
 
-    if (nextProps.productToRemove !== this.props.productToRemove) {
+    if (nextProps.productToRemove === this.props.productToRemove) {
       this.removeProduct(nextProps.productToRemove);
     }

[Killed] EqualityOperator
src/components/FloatCart/index.js:37:9
       this.removeProduct(nextProps.productToRemove);
     }
 
-    if (nextProps.productToChange !== this.props.productToChange) {
+    if (nextProps.productToChange === this.props.productToChange) {
       this.changeProductQuantity(nextProps.productToChange);
     }

[Killed] ConditionalExpression
src/components/FloatCart/index.js:37:9
       this.removeProduct(nextProps.productToRemove);
     }
 
-    if (nextProps.productToChange !== this.props.productToChange) {
+    if (true) {
       this.changeProductQuantity(nextProps.productToChange);
     }

[Survived] BlockStatement
src/components/FloatCart/index.js:42:25
     }
   }
 
-  openFloatCart = () => {
-    this.setState({ isOpen: true });
-  };
+  openFloatCart = () => {};
 
   closeFloatCart = () => {

[Survived] BooleanLiteral
src/components/FloatCart/index.js:43:29
   }
 
   openFloatCart = () => {
-    this.setState({ isOpen: true });
+    this.setState({ isOpen: false });
   };
 

[Survived] ObjectLiteral
src/components/FloatCart/index.js:43:19
   }
 
   openFloatCart = () => {
-    this.setState({ isOpen: true });
+    this.setState({});
   };
 

[Survived] BlockStatement
src/components/FloatCart/index.js:46:26
     this.setState({ isOpen: true });
   };
 
-  closeFloatCart = () => {
-    this.setState({ isOpen: false });
-  };
+  closeFloatCart = () => {};
 
   addProduct = product => {

[Survived] BooleanLiteral
src/components/FloatCart/index.js:47:29
   };
 
   closeFloatCart = () => {
-    this.setState({ isOpen: false });
+    this.setState({ isOpen: true });
   };
 

[Killed] BlockStatement
src/components/FloatCart/index.js:50:27
     this.setState({ isOpen: false });
   };
 
-  addProduct = product => {
-    const { cartProducts, updateCart } = this.props;
-    let productAlreadyInCart = false;
-
-    cartProducts.forEach(cp => {
-      if (cp.id === product.id) {
-        cp.quantity += product.quantity;
-        productAlreadyInCart = true;
-      }
-    });
-
-    if (!productAlreadyInCart) {
-      cartProducts.push(product);
-    }
-
-    updateCart(cartProducts);
-    this.openFloatCart();
-  };
+  addProduct = product => {};
 
   removeProduct = product => {

[Killed] BooleanLiteral
src/components/FloatCart/index.js:52:32
 
   addProduct = product => {
     const { cartProducts, updateCart } = this.props;
-    let productAlreadyInCart = false;
+    let productAlreadyInCart = true;
 
     cartProducts.forEach(cp => {

[Survived] BlockStatement
src/components/FloatCart/index.js:54:32
     const { cartProducts, updateCart } = this.props;
     let productAlreadyInCart = false;
 
-    cartProducts.forEach(cp => {
-      if (cp.id === product.id) {
-        cp.quantity += product.quantity;
-        productAlreadyInCart = true;
-      }
-    });
+    cartProducts.forEach(cp => {});
 
     if (!productAlreadyInCart) {

[Survived] BlockStatement
src/components/FloatCart/index.js:55:33
     let productAlreadyInCart = false;
 
     cartProducts.forEach(cp => {
-      if (cp.id === product.id) {
-        cp.quantity += product.quantity;
-        productAlreadyInCart = true;
-      }
+      if (cp.id === product.id) {}
     });
 

[Survived] ConditionalExpression
src/components/FloatCart/index.js:55:11
     let productAlreadyInCart = false;
 
     cartProducts.forEach(cp => {
-      if (cp.id === product.id) {
+      if (false) {
         cp.quantity += product.quantity;
         productAlreadyInCart = true;

[Survived] BooleanLiteral
src/components/FloatCart/index.js:57:32
     cartProducts.forEach(cp => {
       if (cp.id === product.id) {
         cp.quantity += product.quantity;
-        productAlreadyInCart = true;
+        productAlreadyInCart = false;
       }
     });

[Killed] ConditionalExpression
src/components/FloatCart/index.js:61:9
       }
     });
 
-    if (!productAlreadyInCart) {
+    if (false) {
       cartProducts.push(product);
     }

[Killed] BooleanLiteral
src/components/FloatCart/index.js:61:9
       }
     });
 
-    if (!productAlreadyInCart) {
+    if (productAlreadyInCart) {
       cartProducts.push(product);
     }

[Survived] BlockStatement
src/components/FloatCart/index.js:69:30
     this.openFloatCart();
   };
 
-  removeProduct = product => {
-    const { cartProducts, updateCart } = this.props;
-
-    const index = cartProducts.findIndex(p => p.id === product.id);
-    if (index >= 0) {
-      cartProducts.splice(index, 1);
-      updateCart(cartProducts);
-    }
-  };
+  removeProduct = product => {};
 
   proceedToCheckout = () => {

[Survived] ArrowFunction
src/components/FloatCart/index.js:72:42
   removeProduct = product => {
     const { cartProducts, updateCart } = this.props;
 
-    const index = cartProducts.findIndex(p => p.id === product.id);
+    const index = cartProducts.findIndex(() => undefined);
     if (index >= 0) {
       cartProducts.splice(index, 1);

[Survived] EqualityOperator
src/components/FloatCart/index.js:72:47
   removeProduct = product => {
     const { cartProducts, updateCart } = this.props;
 
-    const index = cartProducts.findIndex(p => p.id === product.id);
+    const index = cartProducts.findIndex(p => p.id !== product.id);
     if (index >= 0) {
       cartProducts.splice(index, 1);

[Survived] EqualityOperator
src/components/FloatCart/index.js:73:9
     const { cartProducts, updateCart } = this.props;
 
     const index = cartProducts.findIndex(p => p.id === product.id);
-    if (index >= 0) {
+    if (index > 0) {
       cartProducts.splice(index, 1);
       updateCart(cartProducts);

[Survived] ConditionalExpression
src/components/FloatCart/index.js:73:9
     const { cartProducts, updateCart } = this.props;
 
     const index = cartProducts.findIndex(p => p.id === product.id);
-    if (index >= 0) {
+    if (true) {
       cartProducts.splice(index, 1);
       updateCart(cartProducts);

[Survived] BlockStatement
src/components/FloatCart/index.js:79:29
     }
   };
 
-  proceedToCheckout = () => {
-    const {
-      totalPrice,
-      productQuantity,
-      currencyFormat,
-      currencyId
-    } = this.props.cartTotal;
-
-    if (!productQuantity) {
-      alert('Add some product in the cart!');
-    } else {
-      alert(
-        `Checkout - Subtotal: ${currencyFormat} ${formatPrice(
-          totalPrice,
-          currencyId
-        )}`
-      );
-    }
-  };
+  proceedToCheckout = () => {};
 
   changeProductQuantity = changedProduct => {

[Survived] BlockStatement
src/components/FloatCart/index.js:87:27
       currencyId
     } = this.props.cartTotal;
 
-    if (!productQuantity) {
-      alert('Add some product in the cart!');
-    } else {
+    if (!productQuantity) {} else {
       alert(
         `Checkout - Subtotal: ${currencyFormat} ${formatPrice(

[Survived] ConditionalExpression
src/components/FloatCart/index.js:87:9
       currencyId
     } = this.props.cartTotal;
 
-    if (!productQuantity) {
+    if (true) {
       alert('Add some product in the cart!');
     } else {

[Survived] BlockStatement
src/components/FloatCart/index.js:89:12
 
     if (!productQuantity) {
       alert('Add some product in the cart!');
-    } else {
-      alert(
-        `Checkout - Subtotal: ${currencyFormat} ${formatPrice(
-          totalPrice,
-          currencyId
-        )}`
-      );
-    }
+    } else {}
   };
 

[Survived] StringLiteral
src/components/FloatCart/index.js:91:9
       alert('Add some product in the cart!');
     } else {
       alert(
-        `Checkout - Subtotal: ${currencyFormat} ${formatPrice(
-          totalPrice,
-          currencyId
-        )}`
+        ""
       );
     }

[Survived] BlockStatement
src/components/FloatCart/index.js:99:45
     }
   };
 
-  changeProductQuantity = changedProduct => {
-    const { cartProducts, updateCart } = this.props;
-
-    const product = cartProducts.find(p => p.id === changedProduct.id);
-    product.quantity = changedProduct.quantity;
-    if (product.quantity <= 0) {
-      this.removeProduct(product);
-    }
-    updateCart(cartProducts);
-  }
+  changeProductQuantity = changedProduct => {}
 
   render() {

[Survived] ConditionalExpression
src/components/FloatCart/index.js:102:44
   changeProductQuantity = changedProduct => {
     const { cartProducts, updateCart } = this.props;
 
-    const product = cartProducts.find(p => p.id === changedProduct.id);
+    const product = cartProducts.find(p => false);
     product.quantity = changedProduct.quantity;
     if (product.quantity <= 0) {

[Survived] ConditionalExpression
src/components/FloatCart/index.js:102:44
   changeProductQuantity = changedProduct => {
     const { cartProducts, updateCart } = this.props;
 
-    const product = cartProducts.find(p => p.id === changedProduct.id);
+    const product = cartProducts.find(p => true);
     product.quantity = changedProduct.quantity;
     if (product.quantity <= 0) {

[Survived] BlockStatement
src/components/FloatCart/index.js:104:32
 
     const product = cartProducts.find(p => p.id === changedProduct.id);
     product.quantity = changedProduct.quantity;
-    if (product.quantity <= 0) {
-      this.removeProduct(product);
-    }
+    if (product.quantity <= 0) {}
     updateCart(cartProducts);
   }

[Survived] ConditionalExpression
src/components/FloatCart/index.js:104:9
 
     const product = cartProducts.find(p => p.id === changedProduct.id);
     product.quantity = changedProduct.quantity;
-    if (product.quantity <= 0) {
+    if (false) {
       this.removeProduct(product);
     }

[Killed] BlockStatement
src/components/FloatCart/index.js:113:44
   render() {
     const { cartTotal, cartProducts, removeProduct, changeProductQuantity } = this.props;
 
-    const products = cartProducts.map(p => {
-      return (
-        <CartProduct product={p} removeProduct={removeProduct} changeProductQuantity={changeProductQuantity} key={p.id} />
-      );
-    });
+    const products = cartProducts.map(p => {});
 
     let classes = ['float-cart'];

[Survived] ConditionalExpression
src/components/FloatCart/index.js:121:9
 
     let classes = ['float-cart'];
 
-    if (!!this.state.isOpen) {
+    if (false) {
       classes.push('float-cart--open');
     }

[Survived] BlockStatement
src/components/FloatCart/index.js:121:30
 
     let classes = ['float-cart'];
 
-    if (!!this.state.isOpen) {
-      classes.push('float-cart--open');
-    }
+    if (!!this.state.isOpen) {}
 
     return (

[Survived] ConditionalExpression
src/components/FloatCart/index.js:128:10
     return (
       <div className={classes.join(' ')}>
         {/* If cart open, show close (x) button */}
-        {this.state.isOpen && (
-          <div
-            onClick={() => this.closeFloatCart()}
-            className="float-cart__close-btn"
-          >
-            X
-          </div>
-        )}
+        {false}
 
         {/* If cart is closed, show bag with quantity of product and open cart action */}

[Survived] LogicalOperator
src/components/FloatCart/index.js:128:10
     return (
       <div className={classes.join(' ')}>
         {/* If cart open, show close (x) button */}
-        {this.state.isOpen && (
-          <div
-            onClick={() => this.closeFloatCart()}
-            className="float-cart__close-btn"
-          >
-            X
-          </div>
-        )}
+        {this.state.isOpen || <div onClick={() => this.closeFloatCart()} className="float-cart__close-btn">
+            X
+          </div>}
 
         {/* If cart is closed, show bag with quantity of product and open cart action */}

[Survived] ArrowFunction
src/components/FloatCart/index.js:130:22
         {/* If cart open, show close (x) button */}
         {this.state.isOpen && (
           <div
-            onClick={() => this.closeFloatCart()}
+            onClick={() => undefined}
             className="float-cart__close-btn"
           >

[Survived] BooleanLiteral
src/components/FloatCart/index.js:138:10
         )}
 
         {/* If cart is closed, show bag with quantity of product and open cart action */}
-        {!this.state.isOpen && (
+        {this.state.isOpen && (
           <span
             onClick={() => this.openFloatCart()}

[Survived] LogicalOperator
src/components/FloatCart/index.js:138:10
         )}
 
         {/* If cart is closed, show bag with quantity of product and open cart action */}
-        {!this.state.isOpen && (
-          <span
-            onClick={() => this.openFloatCart()}
-            className="bag bag--float-cart-closed"
-          >
-            <span className="bag__quantity">{cartTotal.productQuantity}</span>
-          </span>
-        )}
+        {!this.state.isOpen || <span onClick={() => this.openFloatCart()} className="bag bag--float-cart-closed">
+            <span className="bag__quantity">{cartTotal.productQuantity}</span>
+          </span>}
 
         <div className="float-cart__content">

[Survived] ArrowFunction
src/components/FloatCart/index.js:140:22
         {/* If cart is closed, show bag with quantity of product and open cart action */}
         {!this.state.isOpen && (
           <span
-            onClick={() => this.openFloatCart()}
+            onClick={() => undefined}
             className="bag bag--float-cart-closed"
           >

[Survived] LogicalOperator
src/components/FloatCart/index.js:157:14
 
           <div className="float-cart__shelf-container">
             {products}
-            {!products.length && (
-              <p className="shelf-empty">
-                Add some products in the cart <br />
-                :)
-              </p>
-            )}
+            {!products.length || <p className="shelf-empty">
+                Add some products in the cart <br />
+                :)
+              </p>}
           </div>
 

[Survived] ConditionalExpression
src/components/FloatCart/index.js:157:14
 
           <div className="float-cart__shelf-container">
             {products}
-            {!products.length && (
-              <p className="shelf-empty">
-                Add some products in the cart <br />
-                :)
-              </p>
-            )}
+            {true}
           </div>
 

[Survived] StringLiteral
src/components/FloatCart/index.js:169:18
             <div className="sub">SUBTOTAL</div>
             <div className="sub-price">
               <p className="sub-price__val">
-                {`${cartTotal.currencyFormat} ${formatPrice(
-                  cartTotal.totalPrice,
-                  cartTotal.currencyId
-                )}`}
+                {""}
               </p>
               <small className="sub-price__installment">

[Survived] LogicalOperator
src/components/FloatCart/index.js:175:18
                 )}`}
               </p>
               <small className="sub-price__installment">
-                {!!cartTotal.installments && (
-                  <span>
-                    {`OR UP TO ${cartTotal.installments} x ${
-                      cartTotal.currencyFormat
-                    } ${formatPrice(
-                      cartTotal.totalPrice / cartTotal.installments,
-                      cartTotal.currencyId
-                    )}`}
-                  </span>
-                )}
+                {!!cartTotal.installments || <span>
+                    {`OR UP TO ${cartTotal.installments} x ${cartTotal.currencyFormat} ${formatPrice(cartTotal.totalPrice / cartTotal.installments, cartTotal.currencyId)}`}
+                  </span>}
               </small>
             </div>

[Survived] BooleanLiteral
src/components/FloatCart/index.js:175:19
                 )}`}
               </p>
               <small className="sub-price__installment">
-                {!!cartTotal.installments && (
+                {!cartTotal.installments && (
                   <span>
                     {`OR UP TO ${cartTotal.installments} x ${

[Survived] StringLiteral
src/components/FloatCart/index.js:177:22
               <small className="sub-price__installment">
                 {!!cartTotal.installments && (
                   <span>
-                    {`OR UP TO ${cartTotal.installments} x ${
-                      cartTotal.currencyFormat
-                    } ${formatPrice(
-                      cartTotal.totalPrice / cartTotal.installments,
-                      cartTotal.currencyId
-                    )}`}
+                    {""}
                   </span>
                 )}

[Survived] ArithmeticOperator
src/components/FloatCart/index.js:180:23
                     {`OR UP TO ${cartTotal.installments} x ${
                       cartTotal.currencyFormat
                     } ${formatPrice(
-                      cartTotal.totalPrice / cartTotal.installments,
+                      cartTotal.totalPrice * cartTotal.installments,
                       cartTotal.currencyId
                     )}`}

[Survived] ArrowFunction
src/components/FloatCart/index.js:187:27
                 )}
               </small>
             </div>
-            <div onClick={() => this.proceedToCheckout()} className="buy-btn">
+            <div onClick={() => undefined} className="buy-btn">
               Checkout
             </div>

[Killed] ArrowFunction
src/components/FloatCart/index.js:197:25
   }
 }
 
-const mapStateToProps = state => ({
-  cartProducts: state.cart.products,
-  newProduct: state.cart.productToAdd,
-  productToRemove: state.cart.productToRemove,
-  productToChange: state.cart.productToChange,
-  cartTotal: state.total.data
-});
+const mapStateToProps = () => undefined;
 
 export default connect(
