[Survived] StringLiteral
components/Shelf/Filter/index.js:11:31
 
 import './style.scss';
 
-const availableSizes = ['XS', 'S', 'M', 'ML', 'L', 'XL', 'XXL'];
+const availableSizes = ['XS', "", 'M', 'ML', 'L', 'XL', 'XXL'];
 
 class Filter extends Component {

[Survived] BlockStatement
components/Shelf/Filter/index.js:19:23
     filters: PropTypes.array
   };
 
-  componentDidMount() {
-    this.selectedCheckboxes = new Set();
-  }
+  componentDidMount() {}
 
   toggleCheckbox = label => {

[Survived] BlockStatement
components/Shelf/Filter/index.js:23:29
     this.selectedCheckboxes = new Set();
   }
 
-  toggleCheckbox = label => {
-    if (this.selectedCheckboxes.has(label)) {
-      this.selectedCheckboxes.delete(label);
-    } else {
-      this.selectedCheckboxes.add(label);
-    }
-
-    this.props.updateFilters(Array.from(this.selectedCheckboxes));
-  };
+  toggleCheckbox = label => {};
 
   createCheckbox = label => (

[Survived] ConditionalExpression
components/Shelf/Filter/index.js:24:9
   }
 
   toggleCheckbox = label => {
-    if (this.selectedCheckboxes.has(label)) {
+    if (false) {
       this.selectedCheckboxes.delete(label);
     } else {

[Survived] ConditionalExpression
components/Shelf/Filter/index.js:24:9
   }
 
   toggleCheckbox = label => {
-    if (this.selectedCheckboxes.has(label)) {
+    if (true) {
       this.selectedCheckboxes.delete(label);
     } else {

[Survived] BlockStatement
components/Shelf/Filter/index.js:26:12
   toggleCheckbox = label => {
     if (this.selectedCheckboxes.has(label)) {
       this.selectedCheckboxes.delete(label);
-    } else {
-      this.selectedCheckboxes.add(label);
-    }
+    } else {}
 
     this.props.updateFilters(Array.from(this.selectedCheckboxes));

[Survived] ArrowFunction
components/Shelf/Filter/index.js:33:20
     this.props.updateFilters(Array.from(this.selectedCheckboxes));
   };
 
-  createCheckbox = label => (
-    <Checkbox
-      classes="filters-available-size"
-      label={label}
-      handleCheckboxChange={this.toggleCheckbox}
-      key={label}
-    />
-  );
+  createCheckbox = () => undefined;
 
   createCheckboxes = () => availableSizes.map(this.createCheckbox);

[Survived] ArrowFunction
components/Shelf/Filter/index.js:42:22
     />
   );
 
-  createCheckboxes = () => availableSizes.map(this.createCheckbox);
+  createCheckboxes = () => undefined;
 
   render() {

[Killed] BlockStatement
components/Shelf/Filter/index.js:44:12
 
   createCheckboxes = () => availableSizes.map(this.createCheckbox);
 
-  render() {
-    return (
-      <div className="filters">
-        <h4 className="title">Sizes:</h4>
-        {this.createCheckboxes()}
-        <GithubStarButton />
-      </div>
-    );
-  }
+  render() {}
 }
 
