[Killed] BlockStatement
src/components/Selectbox/index.js:4:61
 import React from 'react';
 import PropTypes from 'prop-types';
 
-const Selectbox = ({ options, classes, handleOnChange }) => {
-  const createOptions = options =>
-    options.map(o => (
-      <option value={o.value} key={o.value}>
-        {o.label}
-      </option>
-    ));
-
-  return (
-    <select onChange={e => handleOnChange(e.target.value)} className={classes}>
-      {createOptions(options)}
-    </select>
-  );
-};
+const Selectbox = ({ options, classes, handleOnChange }) => {};
 
 Selectbox.propTypes = {

[Killed] ArrowFunction
src/components/Selectbox/index.js:5:25
 import PropTypes from 'prop-types';
 
 const Selectbox = ({ options, classes, handleOnChange }) => {
-  const createOptions = options =>
-    options.map(o => (
-      <option value={o.value} key={o.value}>
-        {o.label}
-      </option>
-    ));
+  const createOptions = () => undefined;
 
   return (

[Killed] ArrowFunction
src/components/Selectbox/index.js:6:17
 
 const Selectbox = ({ options, classes, handleOnChange }) => {
   const createOptions = options =>
-    options.map(o => (
-      <option value={o.value} key={o.value}>
-        {o.label}
-      </option>
-    ));
+    options.map(() => undefined);
 
   return (

[Survived] ArrowFunction
src/components/Selectbox/index.js:13:23
     ));
 
   return (
-    <select onChange={e => handleOnChange(e.target.value)} className={classes}>
+    <select onChange={() => undefined} className={classes}>
       {createOptions(options)}
     </select>
