[Survived] ConditionalExpression
Shelf/ProductList/Product/index.js:16:7
 
   let productInstallment;
 
-  if (!!product.installments) {
+  if (false) {
     const installmentPrice = product.price / product.installments;
 

[Survived] BooleanLiteral
Shelf/ProductList/Product/index.js:16:7
 
   let productInstallment;
 
-  if (!!product.installments) {
+  if (!product.installments) {
     const installmentPrice = product.price / product.installments;
 

[Survived] ArithmeticOperator
Shelf/ProductList/Product/index.js:17:30
   let productInstallment;
 
   if (!!product.installments) {
-    const installmentPrice = product.price / product.installments;
+    const installmentPrice = product.price * product.installments;
 
     productInstallment = (

[Killed] ArrowFunction
Shelf/ProductList/Product/index.js:33:16
   return (
     <div
       className="shelf-item"
-      onClick={() => addProduct(product)}
+      onClick={() => undefined}
       data-sku={product.sku}
     >

[Survived] LogicalOperator
Shelf/ProductList/Product/index.js:36:8
       onClick={() => addProduct(product)}
       data-sku={product.sku}
     >
-      {product.isFreeShipping && (
-        <div className="shelf-stopper">Free shipping</div>
-      )}
+      {product.isFreeShipping || <div className="shelf-stopper">Free shipping</div>}
       <Thumb
         classes="shelf-item__thumb"

[Survived] ConditionalExpression
Shelf/ProductList/Product/index.js:36:8
       onClick={() => addProduct(product)}
       data-sku={product.sku}
     >
-      {product.isFreeShipping && (
-        <div className="shelf-stopper">Free shipping</div>
-      )}
+      {false}
       <Thumb
         classes="shelf-item__thumb"

[Survived] StringLiteral
Shelf/ProductList/Product/index.js:41:22
       )}
       <Thumb
         classes="shelf-item__thumb"
-        src={require(`../../../../static/products/${product.sku}_1.jpg`)}
+        src={require("")}
         alt={product.title}
       />

[Survived] ArithmeticOperator
Shelf/ProductList/Product/index.js:48:40
       <div className="shelf-item__price">
         <div className="val">
           <small>{product.currencyFormat}</small>
-          <b>{formattedPrice.substr(0, formattedPrice.length - 3)}</b>
+          <b>{formattedPrice.substr(0, formattedPrice.length + 3)}</b>
           <span>{formattedPrice.substr(formattedPrice.length - 3, 3)}</span>
         </div>

[Survived] ArithmeticOperator
Shelf/ProductList/Product/index.js:49:40
         <div className="val">
           <small>{product.currencyFormat}</small>
           <b>{formattedPrice.substr(0, formattedPrice.length - 3)}</b>
-          <span>{formattedPrice.substr(formattedPrice.length - 3, 3)}</span>
+          <span>{formattedPrice.substr(formattedPrice.length + 3, 3)}</span>
         </div>
         {productInstallment}

[Survived] ObjectLiteral
Shelf/ProductList/Product/index.js:58:21
   );
 };
 
-Product.propTypes = {
-  product: PropTypes.object.isRequired,
-  addProduct: PropTypes.func.isRequired
-};
+Product.propTypes = {};
 
 export default connect(

[Killed] ObjectLiteral
Shelf/ProductList/Product/index.js:65:3
 
 export default connect(
   null,
-  { addProduct }
+  {}
 )(Product);
 
