[Killed] BlockStatement
components/Shelf/ProductList/index.js:5:39
 
 import Product from './Product';
 
-const ProductList = ({ products }) => {
-  return products.map(p => {
-    return <Product product={p} key={p.id} />;
-  });
-};
+const ProductList = ({ products }) => {};
 
 export default ProductList;

[Killed] BlockStatement
components/Shelf/ProductList/index.js:6:28
 import Product from './Product';
 
 const ProductList = ({ products }) => {
-  return products.map(p => {
-    return <Product product={p} key={p.id} />;
-  });
+  return products.map(p => {});
 };
 
