[Killed] BlockStatement
components/Shelf/ShelfHeader/index.js:6:30
 
 import Sort from '../Sort';
 
-const ShelfHeader = props => {
-  return (
-    <div className="shelf-container-header">
-      <small className="products-found">
-        <span>{props.productsLength} Product(s) found.</span>
-      </small>
-      <Sort />
-    </div>
-  );
-};
+const ShelfHeader = props => {};
 
 ShelfHeader.propTypes = {
