[Survived] StringLiteral
components/Shelf/Sort/index.js:9:23
 import Selectbox from '../../Selectbox';
 
 const sortBy = [
-  { value: '', label: 'Select' },
+  { value: '', label: "" },
   { value: 'lowestprice', label: 'Lowest to highest' },
   { value: 'highestprice', label: 'Highest to lowest' }

[Survived] StringLiteral
components/Shelf/Sort/index.js:10:34
 
 const sortBy = [
   { value: '', label: 'Select' },
-  { value: 'lowestprice', label: 'Lowest to highest' },
+  { value: 'lowestprice', label: "" },
   { value: 'highestprice', label: 'Highest to lowest' }
 ];

[Survived] ObjectLiteral
components/Shelf/Sort/index.js:11:3
 const sortBy = [
   { value: '', label: 'Select' },
   { value: 'lowestprice', label: 'Lowest to highest' },
-  { value: 'highestprice', label: 'Highest to lowest' }
+  {}
 ];
 

[Killed] ArrowFunction
components/Shelf/Sort/index.js:14:14
   { value: 'highestprice', label: 'Highest to lowest' }
 ];
 
-const Sort = ({ updateSort, sort }) => (
-  <div className="sort">
-    Order by
-    <Selectbox options={sortBy} handleOnChange={value => updateSort(value)} />
-  </div>
-);
+const Sort = () => undefined;
 
 Sort.propTypes = {

[Survived] ArrowFunction
components/Shelf/Sort/index.js:17:49
 const Sort = ({ updateSort, sort }) => (
   <div className="sort">
     Order by
-    <Selectbox options={sortBy} handleOnChange={value => updateSort(value)} />
+    <Selectbox options={sortBy} handleOnChange={() => undefined} />
   </div>
 );

[Survived] ArrowFunction
components/Shelf/Sort/index.js:26:25
   sort: PropTypes.string.isRequired
 };
 
-const mapStateToProps = state => ({
-  sort: state.sort.type
-});
+const mapStateToProps = () => undefined;
 
 export default connect(
