[Survived] ObjectLiteral
src/components/Shelf/index.js:21:11
     sort: PropTypes.string
   };
 
-  state = {
-    isLoading: false
-  };
+  state = {};
 
   componentDidMount() {

[Survived] BooleanLiteral
src/components/Shelf/index.js:22:16
   };
 
   state = {
-    isLoading: false
+    isLoading: true
   };
 

[Killed] BlockStatement
src/components/Shelf/index.js:25:23
     isLoading: false
   };
 
-  componentDidMount() {
-    this.handleFetchProducts();
-  }
+  componentDidMount() {}
 
   componentWillReceiveProps(nextProps) {

[Survived] BlockStatement
src/components/Shelf/index.js:29:40
     this.handleFetchProducts();
   }
 
-  componentWillReceiveProps(nextProps) {
-    const { filters: nextFilters, sort: nextSort } = nextProps;
-    const { filters } = this.props;
-    if (nextFilters.length !== filters.length) {
-      this.handleFetchProducts(nextFilters, undefined);
-    }
-
-    if (nextSort !== this.props.sort) {
-      this.handleFetchProducts(undefined, nextSort);
-    }
-  }
+  componentWillReceiveProps(nextProps) {}
 
   handleFetchProducts = (

[Survived] ConditionalExpression
src/components/Shelf/index.js:32:9
   componentWillReceiveProps(nextProps) {
     const { filters: nextFilters, sort: nextSort } = nextProps;
     const { filters } = this.props;
-    if (nextFilters.length !== filters.length) {
+    if (false) {
       this.handleFetchProducts(nextFilters, undefined);
     }

[Survived] EqualityOperator
src/components/Shelf/index.js:32:9
   componentWillReceiveProps(nextProps) {
     const { filters: nextFilters, sort: nextSort } = nextProps;
     const { filters } = this.props;
-    if (nextFilters.length !== filters.length) {
+    if (nextFilters.length === filters.length) {
       this.handleFetchProducts(nextFilters, undefined);
     }

[Survived] EqualityOperator
src/components/Shelf/index.js:36:9
       this.handleFetchProducts(nextFilters, undefined);
     }
 
-    if (nextSort !== this.props.sort) {
+    if (nextSort === this.props.sort) {
       this.handleFetchProducts(undefined, nextSort);
     }

[Survived] ConditionalExpression
src/components/Shelf/index.js:36:9
       this.handleFetchProducts(nextFilters, undefined);
     }
 
-    if (nextSort !== this.props.sort) {
+    if (false) {
       this.handleFetchProducts(undefined, nextSort);
     }

[Killed] BlockStatement
src/components/Shelf/index.js:44:8
   handleFetchProducts = (
     filters = this.props.filters,
     sort = this.props.sort
-  ) => {
-    this.setState({ isLoading: true });
-    this.props.fetchProducts(filters, sort, () => {
-      this.setState({ isLoading: false });
-    });
-  };
+  ) => {};
 
   render() {

[Survived] BooleanLiteral
src/components/Shelf/index.js:45:32
     filters = this.props.filters,
     sort = this.props.sort
   ) => {
-    this.setState({ isLoading: true });
+    this.setState({ isLoading: false });
     this.props.fetchProducts(filters, sort, () => {
       this.setState({ isLoading: false });

[Survived] ObjectLiteral
src/components/Shelf/index.js:45:19
     filters = this.props.filters,
     sort = this.props.sort
   ) => {
-    this.setState({ isLoading: true });
+    this.setState({});
     this.props.fetchProducts(filters, sort, () => {
       this.setState({ isLoading: false });

[Survived] BlockStatement
src/components/Shelf/index.js:46:51
     sort = this.props.sort
   ) => {
     this.setState({ isLoading: true });
-    this.props.fetchProducts(filters, sort, () => {
-      this.setState({ isLoading: false });
-    });
+    this.props.fetchProducts(filters, sort, () => {});
   };
 

[Survived] BooleanLiteral
src/components/Shelf/index.js:47:34
   ) => {
     this.setState({ isLoading: true });
     this.props.fetchProducts(filters, sort, () => {
-      this.setState({ isLoading: false });
+      this.setState({ isLoading: true });
     });
   };

[Survived] ObjectLiteral
src/components/Shelf/index.js:47:21
   ) => {
     this.setState({ isLoading: true });
     this.props.fetchProducts(filters, sort, () => {
-      this.setState({ isLoading: false });
+      this.setState({});
     });
   };

[Killed] BlockStatement
src/components/Shelf/index.js:51:12
     });
   };
 
-  render() {
-    const { products } = this.props;
-    const { isLoading } = this.state;
-
-    return (
-      <React.Fragment>
-        {isLoading && <Spinner />}
-        <div className="shelf-container">
-          <ShelfHeader productsLength={products.length} />
-          <ProductList products={products} />
-        </div>
-      </React.Fragment>
-    );
-  }
+  render() {}
 }
 

[Survived] ConditionalExpression
src/components/Shelf/index.js:57:10
 
     return (
       <React.Fragment>
-        {isLoading && <Spinner />}
+        {false}
         <div className="shelf-container">
           <ShelfHeader productsLength={products.length} />

[Survived] LogicalOperator
src/components/Shelf/index.js:57:10
 
     return (
       <React.Fragment>
-        {isLoading && <Spinner />}
+        {isLoading || <Spinner />}
         <div className="shelf-container">
           <ShelfHeader productsLength={products.length} />

[Killed] ArrowFunction
src/components/Shelf/index.js:67:25
   }
 }
 
-const mapStateToProps = state => ({
-  products: state.shelf.products,
-  filters: state.filters.items,
-  sort: state.sort.type
-});
+const mapStateToProps = () => undefined;
 
 export default connect(

[Killed] ObjectLiteral
src/components/Shelf/index.js:75:3
 
 export default connect(
   mapStateToProps,
-  { fetchProducts }
+  {}
 )(Shelf);
 
