[Killed] ArrowFunction
src/components/Spinner/index.js:5:16
 
 import './style.scss';
 
-export default () => (
-  <div className="spinner lds-ring">
-    <div />
-    <div />
-    <div />
-    <div />
-  </div>
-);
+export default () => undefined;
 
