[Survived] StringLiteral
src/components/github/Corner.js:16:15
       height="80"
       viewBox="0 0 250 250"
       style={{
-        fill: '#151513',
+        fill: "",
         color: '#fff',
         position: 'absolute',

[Survived] StringLiteral
src/components/github/Corner.js:30:35
       <path
         d="M128.3,109.0 C113.8,99.7 119.0,89.6 119.0,89.6 C122.0,82.7 120.5,78.6 120.5,78.6 C119.2,72.0 123.4,76.3 123.4,76.3 C127.3,80.9 125.5,87.3 125.5,87.3 C122.9,97.6 130.6,101.9 134.4,103.2"
         fill="currentColor"
-        style={{ transformOrigin: '130px 106px' }}
+        style={{ transformOrigin: "" }}
         className="octo-arm"
       />
