[Killed] ArrowFunction
src/components/Thumb/index.js:4:15
 import React from 'react';
 import PropTypes from 'prop-types';
 
-const Thumb = props => (
-  <div className={props.classes}>
-    <img src={props.src} alt={props.alt} title={props.title} />
-  </div>
-);
+const Thumb = () => undefined;
 
 Thumb.propTypes = {

[Survived] ObjectLiteral
src/components/Thumb/index.js:10:19
   </div>
 );
 
-Thumb.propTypes = {
-  alt: PropTypes.string,
-  title: PropTypes.string,
-  classes: PropTypes.string,
-  src: PropTypes.string.isRequired
-};
+Thumb.propTypes = {};
 
 export default Thumb;
