[Survived] StringLiteral
src/services/cart/actionTypes.js:4:40
 export const LOAD_CART = 'LOAD_CART';
 export const ADD_PRODUCT = 'ADD_PRODUCT';
 export const REMOVE_PRODUCT = 'REMOVE_PRODUCT';
-export const CHANGE_PRODUCT_QUANTITY = 'CHANGE_PRODUCT_QUANTITY';
+export const CHANGE_PRODUCT_QUANTITY = "";
 export const UPDATE_CART = 'UPDATE_CART';
 
