[Killed] ArrowFunction
src/services/cart/actions.js:3:25
 import { LOAD_CART, ADD_PRODUCT, REMOVE_PRODUCT, CHANGE_PRODUCT_QUANTITY } from './actionTypes';
 
-export const loadCart = products => ({
-  type: LOAD_CART,
-  payload: products
-});
+export const loadCart = () => undefined;
 
 export const addProduct = product => ({

[Killed] ObjectLiteral
src/services/cart/actions.js:3:38
 import { LOAD_CART, ADD_PRODUCT, REMOVE_PRODUCT, CHANGE_PRODUCT_QUANTITY } from './actionTypes';
 
-export const loadCart = products => ({
-  type: LOAD_CART,
-  payload: products
-});
+export const loadCart = products => ({});
 
 export const addProduct = product => ({

[Killed] ArrowFunction
src/services/cart/actions.js:8:27
   payload: products
 });
 
-export const addProduct = product => ({
-  type: ADD_PRODUCT,
-  payload: product
-});
+export const addProduct = () => undefined;
 
 export const removeProduct = product => ({

[Killed] ArrowFunction
src/services/cart/actions.js:13:30
   payload: product
 });
 
-export const removeProduct = product => ({
-  type: REMOVE_PRODUCT,
-  payload: product
-});
+export const removeProduct = () => undefined;
 
 export const changeProductQuantity = product => ({

[Survived] ArrowFunction
src/services/cart/actions.js:18:38
   payload: product
 });
 
-export const changeProductQuantity = product => ({
-  type: CHANGE_PRODUCT_QUANTITY,
-  payload: product
-});
+export const changeProductQuantity = () => undefined;
