[Survived] ConditionalExpression
src/services/cart/reducer.js:9:5
 
 export default function(state = initialState, action) {
   switch (action.type) {
-    case LOAD_CART:
-      return {
-        ...state,
-        products: action.payload
-      };
+    case LOAD_CART:
     case ADD_PRODUCT:
       return {

[Survived] ObjectLiteral
src/services/cart/reducer.js:10:14
 export default function(state = initialState, action) {
   switch (action.type) {
     case LOAD_CART:
-      return {
-        ...state,
-        products: action.payload
-      };
+      return {};
     case ADD_PRODUCT:
       return {

[Killed] ConditionalExpression
src/services/cart/reducer.js:14:5
         ...state,
         products: action.payload
       };
-    case ADD_PRODUCT:
-      return {
-        ...state,
-        productToAdd: Object.assign({}, action.payload)
-      };
+    case ADD_PRODUCT:
     case REMOVE_PRODUCT:
       return {

[Survived] ConditionalExpression
src/services/cart/reducer.js:19:5
         ...state,
         productToAdd: Object.assign({}, action.payload)
       };
-    case REMOVE_PRODUCT:
-      return {
-        ...state,
-        productToRemove: Object.assign({}, action.payload)
-      };
+    case REMOVE_PRODUCT:
     case CHANGE_PRODUCT_QUANTITY:
       return {

[Survived] ObjectLiteral
src/services/cart/reducer.js:20:14
         productToAdd: Object.assign({}, action.payload)
       };
     case REMOVE_PRODUCT:
-      return {
-        ...state,
-        productToRemove: Object.assign({}, action.payload)
-      };
+      return {};
     case CHANGE_PRODUCT_QUANTITY:
       return {

[Survived] ConditionalExpression
src/services/cart/reducer.js:24:5
         ...state,
         productToRemove: Object.assign({}, action.payload)
       };
-    case CHANGE_PRODUCT_QUANTITY:
-      return {
-        ...state,
-        productToChange: Object.assign({}, action.payload)
-      };
+    case CHANGE_PRODUCT_QUANTITY:
     default:
       return state;

[Survived] ObjectLiteral
src/services/cart/reducer.js:25:14
         productToRemove: Object.assign({}, action.payload)
       };
     case CHANGE_PRODUCT_QUANTITY:
-      return {
-        ...state,
-        productToChange: Object.assign({}, action.payload)
-      };
+      return {};
     default:
       return state;

[Killed] ConditionalExpression
src/services/cart/reducer.js:29:5
         ...state,
         productToChange: Object.assign({}, action.payload)
       };
-    default:
-      return state;
+    default:
   }
 }
