[Killed] ArrowFunction
src/services/filters/actions.js:3:30
 import { UPDATE_FILTER } from './actionTypes';
 
-export const updateFilters = filters => ({
-  type: UPDATE_FILTER,
-  payload: filters
-});
+export const updateFilters = () => undefined;
 

[Killed] ObjectLiteral
src/services/filters/actions.js:3:42
 import { UPDATE_FILTER } from './actionTypes';
 
-export const updateFilters = filters => ({
-  type: UPDATE_FILTER,
-  payload: filters
-});
+export const updateFilters = filters => ({});
 
