[Killed] BlockStatement
src/services/filters/reducer.js:7:55
   items: []
 };
 
-export default function(state = initialState, action) {
-  switch (action.type) {
-    case UPDATE_FILTER:
-      return {
-        ...state,
-        items: action.payload
-      };
-    default:
-      return state;
-  }
-}
+export default function(state = initialState, action) {}
 

[Survived] ConditionalExpression
src/services/filters/reducer.js:9:5
 
 export default function(state = initialState, action) {
   switch (action.type) {
-    case UPDATE_FILTER:
-      return {
-        ...state,
-        items: action.payload
-      };
+    case UPDATE_FILTER:
     default:
       return state;
