[Survived] BlockStatement
src/services/shelf/actions.js:7:26
 import { productsAPI } from '../util';
 
 const compare = {
-  lowestprice: (a, b) => {
-    if (a.price < b.price) return -1;
-    if (a.price > b.price) return 1;
-    return 0;
-  },
+  lowestprice: (a, b) => {},
   highestprice: (a, b) => {
     if (a.price > b.price) return -1;

[Survived] EqualityOperator
src/services/shelf/actions.js:8:9
 
 const compare = {
   lowestprice: (a, b) => {
-    if (a.price < b.price) return -1;
+    if (a.price >= b.price) return -1;
     if (a.price > b.price) return 1;
     return 0;

[Survived] UnaryOperator
src/services/shelf/actions.js:8:35
 
 const compare = {
   lowestprice: (a, b) => {
-    if (a.price < b.price) return -1;
+    if (a.price < b.price) return +1;
     if (a.price > b.price) return 1;
     return 0;

[Survived] EqualityOperator
src/services/shelf/actions.js:9:9
 const compare = {
   lowestprice: (a, b) => {
     if (a.price < b.price) return -1;
-    if (a.price > b.price) return 1;
+    if (a.price >= b.price) return 1;
     return 0;
   },

[Survived] EqualityOperator
src/services/shelf/actions.js:9:9
 const compare = {
   lowestprice: (a, b) => {
     if (a.price < b.price) return -1;
-    if (a.price > b.price) return 1;
+    if (a.price <= b.price) return 1;
     return 0;
   },

[Survived] BlockStatement
src/services/shelf/actions.js:12:27
     if (a.price > b.price) return 1;
     return 0;
   },
-  highestprice: (a, b) => {
-    if (a.price > b.price) return -1;
-    if (a.price < b.price) return 1;
-    return 0;
-  }
+  highestprice: (a, b) => {}
 };
 

[Survived] EqualityOperator
src/services/shelf/actions.js:13:9
     return 0;
   },
   highestprice: (a, b) => {
-    if (a.price > b.price) return -1;
+    if (a.price <= b.price) return -1;
     if (a.price < b.price) return 1;
     return 0;

[Survived] ConditionalExpression
src/services/shelf/actions.js:13:9
     return 0;
   },
   highestprice: (a, b) => {
-    if (a.price > b.price) return -1;
+    if (false) return -1;
     if (a.price < b.price) return 1;
     return 0;

[Survived] EqualityOperator
src/services/shelf/actions.js:14:9
   },
   highestprice: (a, b) => {
     if (a.price > b.price) return -1;
-    if (a.price < b.price) return 1;
+    if (a.price >= b.price) return 1;
     return 0;
   }

[Survived] ConditionalExpression
src/services/shelf/actions.js:14:9
   },
   highestprice: (a, b) => {
     if (a.price > b.price) return -1;
-    if (a.price < b.price) return 1;
+    if (false) return 1;
     return 0;
   }

[Killed] BlockStatement
src/services/shelf/actions.js:22:18
 export const fetchProducts = (filters, sortBy, callback) => dispatch => {
   return axios
     .get(productsAPI)
-    .then(res => {
-      let { products } = res.data;
-
-      if (!!filters && filters.length > 0) {
-        products = products.filter(p =>
-          filters.find(f => p.availableSizes.find(size => size === f))
-        );
-      }
-
-      if (!!sortBy) {
-        products = products.sort(compare[sortBy]);
-      }
-
-      if (!!callback) {
-        callback();
-      }
-
-      return dispatch({
-        type: FETCH_PRODUCTS,
-        payload: products
-      });
-    })
+    .then(res => {})
     .catch(err => {
       console.log('Could not fetch products. Try again later.');

[Killed] LogicalOperator
src/services/shelf/actions.js:25:11
     .then(res => {
       let { products } = res.data;
 
-      if (!!filters && filters.length > 0) {
+      if (!!filters || filters.length > 0) {
         products = products.filter(p =>
           filters.find(f => p.availableSizes.find(size => size === f))

[Killed] EqualityOperator
src/services/shelf/actions.js:25:24
     .then(res => {
       let { products } = res.data;
 
-      if (!!filters && filters.length > 0) {
+      if (!!filters && filters.length >= 0) {
         products = products.filter(p =>
           filters.find(f => p.availableSizes.find(size => size === f))

[Survived] ArrowFunction
src/services/shelf/actions.js:26:36
       let { products } = res.data;
 
       if (!!filters && filters.length > 0) {
-        products = products.filter(p =>
-          filters.find(f => p.availableSizes.find(size => size === f))
+        products = products.filter(() => undefined
         );
       }

[Survived] ConditionalExpression
src/services/shelf/actions.js:27:59
 
       if (!!filters && filters.length > 0) {
         products = products.filter(p =>
-          filters.find(f => p.availableSizes.find(size => size === f))
+          filters.find(f => p.availableSizes.find(size => true))
         );
       }

[Survived] ArrowFunction
src/services/shelf/actions.js:27:51
 
       if (!!filters && filters.length > 0) {
         products = products.filter(p =>
-          filters.find(f => p.availableSizes.find(size => size === f))
+          filters.find(f => p.availableSizes.find(() => undefined))
         );
       }

[Survived] ConditionalExpression
src/services/shelf/actions.js:31:11
         );
       }
 
-      if (!!sortBy) {
+      if (true) {
         products = products.sort(compare[sortBy]);
       }

[Survived] BlockStatement
src/services/shelf/actions.js:31:21
         );
       }
 
-      if (!!sortBy) {
-        products = products.sort(compare[sortBy]);
-      }
+      if (!!sortBy) {}
 
       if (!!callback) {

[Survived] BlockStatement
src/services/shelf/actions.js:35:23
         products = products.sort(compare[sortBy]);
       }
 
-      if (!!callback) {
-        callback();
-      }
+      if (!!callback) {}
 
       return dispatch({

[Survived] BooleanLiteral
src/services/shelf/actions.js:35:12
         products = products.sort(compare[sortBy]);
       }
 
-      if (!!callback) {
+      if (!callback) {
         callback();
       }

[Survived] BlockStatement
src/services/shelf/actions.js:44:19
         payload: products
       });
     })
-    .catch(err => {
-      console.log('Could not fetch products. Try again later.');
-    });
+    .catch(err => {});
 };
 
