[Killed] ArrayDeclaration
src/services/shelf/reducer.js:4:13
 import { FETCH_PRODUCTS } from './actionTypes';
 
 const initialState = {
-  products: []
+  products: ["Stryker was here"]
 };
 

[Killed] BlockStatement
src/services/shelf/reducer.js:7:55
   products: []
 };
 
-export default function(state = initialState, action) {
-  switch (action.type) {
-    case FETCH_PRODUCTS:
-      return {
-        ...state,
-        products: action.payload
-      };
-    default:
-      return state;
-  }
-}
+export default function(state = initialState, action) {}
 

[Killed] ConditionalExpression
src/services/shelf/reducer.js:9:5
 
 export default function(state = initialState, action) {
   switch (action.type) {
-    case FETCH_PRODUCTS:
-      return {
-        ...state,
-        products: action.payload
-      };
+    case FETCH_PRODUCTS:
     default:
       return state;

[Killed] ObjectLiteral
src/services/shelf/reducer.js:10:14
 export default function(state = initialState, action) {
   switch (action.type) {
     case FETCH_PRODUCTS:
-      return {
-        ...state,
-        products: action.payload
-      };
+      return {};
     default:
       return state;
