[Killed] ArrowFunction
src/services/sort/actions.js:3:27
 import { UPDATE_SORT } from './actionTypes';
 
-export const updateSort = sort => ({
-  type: UPDATE_SORT,
-  payload: sort
-});
+export const updateSort = () => undefined;
 
