[Survived] StringLiteral
src/services/sort/reducer.js:4:9
 import { UPDATE_SORT } from './actionTypes';
 
 const initialState = {
-  type: ''
+  type: "Stryker was here!"
 };
 

[Killed] BlockStatement
src/services/sort/reducer.js:7:55
   type: ''
 };
 
-export default function(state = initialState, action) {
-  switch (action.type) {
-    case UPDATE_SORT:
-      return {
-        ...state,
-        type: action.payload
-      };
-    default:
-      return state;
-  }
-}
+export default function(state = initialState, action) {}
 

[Survived] ConditionalExpression
src/services/sort/reducer.js:9:5
 
 export default function(state = initialState, action) {
   switch (action.type) {
-    case UPDATE_SORT:
-      return {
-        ...state,
-        type: action.payload
-      };
+    case UPDATE_SORT:
     default:
       return state;
