[Killed] LogicalOperator
react-shopping-cart/src/services/store.js:7:5
 
 export default initialState => {
   initialState =
-    JSON.parse(window.localStorage.getItem('state')) || initialState;
+    JSON.parse(window.localStorage.getItem('state')) && initialState;
   const middleware = [thunk];
 

[Killed] ConditionalExpression
react-shopping-cart/src/services/store.js:7:5
 
 export default initialState => {
   initialState =
-    JSON.parse(window.localStorage.getItem('state')) || initialState;
+    false;
   const middleware = [thunk];
 

[Killed] ArrayDeclaration
react-shopping-cart/src/services/store.js:8:22
 export default initialState => {
   initialState =
     JSON.parse(window.localStorage.getItem('state')) || initialState;
-  const middleware = [thunk];
+  const middleware = [];
 
   const store = createStore(

[Survived] BlockStatement
react-shopping-cart/src/services/store.js:20:25
     )
   );
 
-  store.subscribe(() => {
-    const state = store.getState();
-    const persist = {
-      cart: state.cart,
-      total: state.total
-    };
-
-    window.localStorage.setItem('state', JSON.stringify(persist));
-  });
+  store.subscribe(() => {});
 
   return store;

[Survived] StringLiteral
react-shopping-cart/src/services/store.js:27:33
       total: state.total
     };
 
-    window.localStorage.setItem('state', JSON.stringify(persist));
+    window.localStorage.setItem("", JSON.stringify(persist));
   });
 
