[Survived] BlockStatement
src/services/total/actions.js:4:57
 import { UPDATE_CART } from './actionTypes';
 
 export const updateCart = cartProducts => dispatch => {
-  let productQuantity = cartProducts.reduce((sum, p) => {
-    sum += p.quantity;
-    return sum;
-  }, 0);
+  let productQuantity = cartProducts.reduce((sum, p) => {}, 0);
 
   let totalPrice = cartProducts.reduce((sum, p) => {

[Killed] BlockStatement
src/services/total/actions.js:9:52
     return sum;
   }, 0);
 
-  let totalPrice = cartProducts.reduce((sum, p) => {
-    sum += p.price * p.quantity;
-    return sum;
-  }, 0);
+  let totalPrice = cartProducts.reduce((sum, p) => {}, 0);
 
   let installments = cartProducts.reduce((greater, p) => {

[Survived] ArithmeticOperator
src/services/total/actions.js:10:12
   }, 0);
 
   let totalPrice = cartProducts.reduce((sum, p) => {
-    sum += p.price * p.quantity;
+    sum += p.price / p.quantity;
     return sum;
   }, 0);

[Survived] BlockStatement
src/services/total/actions.js:14:58
     return sum;
   }, 0);
 
-  let installments = cartProducts.reduce((greater, p) => {
-    greater = p.installments > greater ? p.installments : greater;
-    return greater;
-  }, 0);
+  let installments = cartProducts.reduce((greater, p) => {}, 0);
 
   let cartTotal = {

[Survived] ConditionalExpression
src/services/total/actions.js:15:15
   }, 0);
 
   let installments = cartProducts.reduce((greater, p) => {
-    greater = p.installments > greater ? p.installments : greater;
+    greater = true ? p.installments : greater;
     return greater;
   }, 0);

[Survived] EqualityOperator
src/services/total/actions.js:15:15
   }, 0);
 
   let installments = cartProducts.reduce((greater, p) => {
-    greater = p.installments > greater ? p.installments : greater;
+    greater = p.installments <= greater ? p.installments : greater;
     return greater;
   }, 0);

[Killed] ObjectLiteral
src/services/total/actions.js:19:19
     return greater;
   }, 0);
 
-  let cartTotal = {
-    productQuantity,
-    installments,
-    totalPrice,
-    currencyId: 'USD',
-    currencyFormat: '$'
-  };
+  let cartTotal = {};
 
   dispatch({

[Survived] StringLiteral
src/services/total/actions.js:24:21
     installments,
     totalPrice,
     currencyId: 'USD',
-    currencyFormat: '$'
+    currencyFormat: ""
   };
 

[Killed] ObjectLiteral
src/services/total/actions.js:27:12
     currencyFormat: '$'
   };
 
-  dispatch({
-    type: UPDATE_CART,
-    payload: cartTotal
-  });
+  dispatch({});
 };
 
