[Killed] ObjectLiteral
src/services/total/reducer.js:3:22
 import { UPDATE_CART } from './actionTypes';
 
-const initialState = {
-  data: {
-    productQuantity: 0,
-    installments: 0,
-    totalPrice: 0,
-    currencyId: 'USD',
-    currencyFormat: '$'
-  }
-};
+const initialState = {};
 
 export default function(state = initialState, action) {

[Killed] BlockStatement
src/services/total/reducer.js:13:55
   }
 };
 
-export default function(state = initialState, action) {
-  switch (action.type) {
-    case UPDATE_CART:
-      return {
-        ...state,
-        data: action.payload
-      };
-    default:
-      return state;
-  }
-}
+export default function(state = initialState, action) {}
 

[Survived] ConditionalExpression
src/services/total/reducer.js:15:5
 
 export default function(state = initialState, action) {
   switch (action.type) {
-    case UPDATE_CART:
-      return {
-        ...state,
-        data: action.payload
-      };
+    case UPDATE_CART:
     default:
       return state;

[Killed] ObjectLiteral
src/services/total/reducer.js:16:14
 export default function(state = initialState, action) {
   switch (action.type) {
     case UPDATE_CART:
-      return {
-        ...state,
-        data: action.payload
-      };
+      return {};
     default:
       return state;
