[Survived] ObjectLiteral
Shoppingtest/react-shopping-cart/src/setupTests.js:5:18
 import Enzyme, { shallow, render, mount } from 'enzyme';
 import adapter from 'enzyme-adapter-react-16';
 
-Enzyme.configure({ adapter: new adapter() });
+Enzyme.configure({});
 
 /* Globals only for tests */
