[Killed] BlockStatement
react-shopping-cart/src/services/util.js:1:45
-export const formatPrice = (x, currency) => {
-  switch (currency) {
-    case 'BRL':
-      return x.toFixed(2).replace('.', ',');
-    default:
-      return x.toFixed(2);
-  }
-};
+export const formatPrice = (x, currency) => {};
 
 export const productsAPI =

[Killed] ConditionalExpression
react-shopping-cart/src/services/util.js:3:5
 export const formatPrice = (x, currency) => {
   switch (currency) {
-    case 'BRL':
-      return x.toFixed(2).replace('.', ',');
+    case 'BRL':
     default:
       return x.toFixed(2);

[Killed] StringLiteral
react-shopping-cart/src/services/util.js:4:35
 export const formatPrice = (x, currency) => {
   switch (currency) {
     case 'BRL':
-      return x.toFixed(2).replace('.', ',');
+      return x.toFixed(2).replace("", ',');
     default:
       return x.toFixed(2);

[Killed] ConditionalExpression
react-shopping-cart/src/services/util.js:5:5
   switch (currency) {
     case 'BRL':
       return x.toFixed(2).replace('.', ',');
-    default:
-      return x.toFixed(2);
+    default:
   }
 };
